Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm.c
static void pdm_pcm_block_clk_init(pdm_pcm_block_obj_t *block) {
    pclk_div_slave_init(block->clk, block->mmio_slave_nr);

    uint32_t clock_freq = pclk_div_get_input_freq(block->clk);
    if (clock_freq == 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("failed to get clock frequency for PDM PCM(%u)"), block->id);
    }

    /**
     * The master clock is set to 12.288 MHz.
     * This value is chosen because from it the provided
     * sampling rates can be derived using the available dividers.
     */
    #define PDM_PCM_MASTER_CLOCK_FREQ 12288000
    /**
     * DPLL output is slightly off from the ideal (e.g. 49151999 vs 49152000 Hz),
     * so plain integer division would truncate to the wrong quotient.
     * Rounding compensates for this.
     */
    #define DIV_ROUND(x, d)    (((x) + (d) / 2) / (d))
    uint32_t divider = DIV_ROUND(clock_freq, PDM_PCM_MASTER_CLOCK_FREQ) - 1;

    block->pclk_div = pclk_div_init(block->clk, divider, 0);
    if (block->pclk_div == NULL) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("failed to initialize clock divider for PDM PCM(%u)"), block->id);
    }
#undef PDM_PCM_MASTER_CLOCK_FREQ
#undef DIV_ROUND
}

static void pdm_pcm_block_clk_deinit(pdm_pcm_block_obj_t *block) {
    pclk_div_deinit(block->pclk_div);
    pclk_div_slave_deinit(block->clk, block->mmio_slave_nr);
}

static void pdm_pcm_block_init(pdm_pcm_block_obj_t *block) {
    /* Only initialize if not already owned */
    if (block->owner_count > 0) {
        block->owner_count++;
        return;
    }

    /* -- Clock configuration -- */
    pdm_pcm_block_clk_init(block);

    /**
     * Additionally the PDM peripheral clock divider is
     * set to 7, which will divide the master clock by 8.
     * This will result in a PDM clock of 1.536 MHz.
     * And that supports the following sample rates:
     * - 8 kHz: 1.536 MHz / 192
     * - 16 kHz: 1.536 MHz / 96
     * - 32 kHz: 1.536 MHz / 48
     * - 48 kHz: 1.536 MHz / 32
     *
     * The dividing factor will be then set by the
     * CIC, FIR0 and FIR1 decimation factors.
     */
    #define PDM_PCK_BLOCK_DIVIDER (7)

    cy_stc_pdm_pcm_config_v2_t pdm_pcm_block_conf = {
        .clkDiv = PDM_PCK_BLOCK_DIVIDER,
        .clksel = CY_PDM_PCM_SEL_SRSS_CLOCK,
        .halverate = CY_PDM_PCM_RATE_FULL,
        .route = 4,
        .fir0_coeff_user_value = false,
        .fir1_coeff_user_value = false,
    };

    cy_en_pdm_pcm_status_t ret = Cy_PDM_PCM_Init(block->periph, &pdm_pcm_block_conf);
    pdm_pcm_assert_raise_val("PDM PCM initialization failed with code: %d \r\n", ret);
#undef PDM_PCK_BLOCK_DIVIDER
    block->owner_count++;
}

static inline void pdm_pcm_block_deinit(pdm_pcm_block_obj_t *block) {
    block->owner_count--;
    if (block->owner_count > 0) {
        return;
    }
    Cy_PDM_PCM_DeInit(block->periph);
    pdm_pcm_block_clk_deinit(block);
}

/* -------------------------------- PDM Channel -------------------------------- */

#define MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(DO) \
    DO(0) \
    DO(1) \
    DO(2) \
    DO(3) \
    DO(4) \
    DO(5)

#define MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES 6

typedef struct _pdm_pcm_channel_obj_t {
    pdm_pcm_block_obj_t *block;
    uint8_t id;
    sys_int_cfg_t irq;
    mp_obj_t parent;
} pdm_pcm_channel_obj_t;

/* Forward declaration */
static void pdm_pcm_channel_irq_handler(uint8_t pdm_pcm_channel);

#define DEFINE_PDM_PCM_CHANNEL_IRQ_HANDLER(pdm_pcm_channel) \
    void PDM_PCM##pdm_pcm_channel##_Channel_IRQ_Handler(void) { \
        pdm_pcm_channel_irq_handler(pdm_pcm_channel); \
    }

MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(DEFINE_PDM_PCM_CHANNEL_IRQ_HANDLER)

#define MAP_PDM_PCM_CONFIG(pdm_pcm_channel) \
    [pdm_pcm_channel] = { \
        &pdm_pcm_block_obj[0], \
        pdm_pcm_channel, \
        { \
            pdm_0_interrupts_##pdm_pcm_channel##_IRQn, \
            SYS_INT_IRQ_LOWEST_PRIORITY, \
            PDM_PCM##pdm_pcm_channel##_Channel_IRQ_Handler \
        }, \
        NULL, \
    },

static pdm_pcm_channel_obj_t pdm_pcm_channel_obj[MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES] = {
    MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(MAP_PDM_PCM_CONFIG)
};

static pdm_pcm_channel_obj_t *pdm_pcm_channel_alloc(uint8_t channel_id, mp_obj_t parent) {
    if (pdm_pcm_channel_obj[channel_id].parent != NULL) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("PDM0 channel %u is already in use by another instance."), channel_id);
    }
    pdm_pcm_channel_obj[channel_id].parent = parent;
    return &pdm_pcm_channel_obj[channel_id];
}

static void pdm_pcm_channel_free(pdm_pcm_channel_obj_t *chan_obj) {
    if (chan_obj->id >= MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid channel id"));
    }
    chan_obj->parent = NULL;
}

static void pdm_pcm_channel_init(pdm_pcm_channel_obj_t *chan_obj, sample_rate_t sample_rate, pdm_pcm_word_length_t word_length, bool second_channel) {

    pdm_pcm_block_init(chan_obj->block);

    Cy_PDM_PCM_Channel_Enable(chan_obj->block->periph, chan_obj->id);

    /**
     * Configuration notes:
     * - For stereo channels, the second channel should
     *   set a sample delay. See more in the
     *   PSOC™ Edge E8x2, E8x3, E8x5, E8x6 architecture reference manual Rev. *A
     *   Section 29.3.3, page 773.
     * - TODO: Filter configuration base on sample_rate and PDM0 clock config.
     */
    cy_stc_pdm_pcm_channel_config_t channel_config = {
        .sampledelay = (second_channel) ? 5: 1,
        .wordSize = (word_length == BITS_16) ? CY_PDM_PCM_WSIZE_16_BIT : CY_PDM_PCM_WSIZE_32_BIT,
        .signExtension = true,
        .rxFifoTriggerLevel = RX_HW_FIFO_IRQ_TRIGGER_LEVEL - 1,
        .fir0_enable = false,
        .cic_decim_code = CY_PDM_PCM_CHAN_CIC_DECIM_32,
        .fir0_decim_code = CY_PDM_PCM_CHAN_FIR0_DECIM_1,
        .fir0_scale = 0,
        .fir1_decim_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3,
        .fir1_scale = 10,
        .dc_block_disable = false,
        .dc_block_code = CY_PDM_PCM_CHAN_DCBLOCK_CODE_16,
    };

    cy_en_pdm_pcm_status_t ret = Cy_PDM_PCM_Channel_Init(chan_obj->block->periph, &channel_config, chan_obj->id);
    pdm_pcm_assert_raise_val("PDM PCM channel initialization failed with code: %d \r\n", ret);
}

static void pdm_pcm_channel_deinit(pdm_pcm_channel_obj_t *chan_obj) {
    Cy_PDM_PCM_Channel_DeInit(chan_obj->block->periph, chan_obj->id);
    Cy_PDM_PCM_Channel_Disable(chan_obj->block->periph, chan_obj->id);
    pdm_pcm_block_deinit(chan_obj->block);
}

static void pdm_pcm_channel_irq_init(pdm_pcm_channel_obj_t *chan_obj) {
    Cy_PDM_PCM_Channel_ClearInterrupt(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);
    Cy_PDM_PCM_Channel_SetInterruptMask(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);

