Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm.c
    sys_int_init(&(chan_obj->irq));
}

static void pdm_pcm_channel_irq_deinit(pdm_pcm_channel_obj_t *chan_obj) {
    sys_int_deinit(&(chan_obj->irq));
    Cy_PDM_PCM_Channel_ClearInterrupt(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);
}

/* -------------------------------- PDM PCM Object -------------------------------- */

typedef struct _machine_pdm_pcm_obj_t {
    mp_obj_base_t base;
    uint8_t id;     // Private variable in this port. ID not associated to any port pin pdm-pcm group.
    mp_hal_pin_obj_t sck;
    mp_hal_pin_obj_t data;
    io_mode_t io_mode;
    format_t format;
    uint8_t bits;
    uint32_t sample_rate;
    float gain_db;
    pdm_pcm_channel_obj_t *channels[2];
    pdm_pcm_channel_obj_t *irq_channel;
    pcm_pdm_rx_fifo_ping_pong_buffer_t rx_buffer;
    ringbuf_t ring_buffer;
    mp_obj_t callback_for_non_blocking;
    non_blocking_descriptor_t non_blocking_descriptor;
} machine_pdm_pcm_obj_t;

static void pdm_pcm_read_half_rx_fifo_into_rx_buffer(machine_pdm_pcm_obj_t *self, uint32_t *rx_buf_next_frame_start_ptr) {
    for (uint32_t index = 0; index < RX_HW_FIFO_IRQ_TRIGGER_LEVEL; index++)
    {
        uint32_t data = (uint32_t)Cy_PDM_PCM_Channel_ReadFifo(self->channels[0]->block->periph, self->channels[0]->id);
        /**
         * The mono/stereo first channel uses the even indexes.
         */
        rx_buf_next_frame_start_ptr[index * 2] = data;
        if (self->format == STEREO) {
            data = Cy_PDM_PCM_Channel_ReadFifo(self->channels[1]->block->periph, self->channels[1]->id);
            /**
             * The stereo second channel uses the odd indexes.
             */
            rx_buf_next_frame_start_ptr[index * 2 + 1] = data;
        }
    }
}

static void pdm_pcm_read_into_rx_buffer(machine_pdm_pcm_obj_t *self) {
    uint32_t *rx_buf_next_frame_start_ptr = pdm_pcm_rx_buffer_get_next_frame_to_fill(&self->rx_buffer);
    pdm_pcm_read_half_rx_fifo_into_rx_buffer(self, rx_buf_next_frame_start_ptr);
}

/* -------------------------------- Ring Buffer Transfer IRQ -------------------------------- */

#define PDM_PCM_RX_FRAME_SIZE_IN_BYTES     (8)
#define PDM_PCM_SIZEOF_NON_BLOCKING_COPY_IN_BYTES    (SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * PDM_PCM_RX_FRAME_SIZE_IN_BYTES)

static const int8_t pdm_pcm_frame_map[4][PDM_PCM_RX_FRAME_SIZE_IN_BYTES] = {
    { 0,  1, -1, -1, -1, -1, -1, -1 },  // Mono, 16-bits
    { 0,  1,  2,  3, -1, -1, -1, -1 },  // Mono, 32-bits
    { 0,  1, -1, -1,  2,  3, -1, -1 },  // Stereo, 16-bits
    { 0,  1,  2,  3,  4,  5,  6,  7 },  // Stereo, 32-bits
};

int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        if (bits == 16) {
            return 0;
        } else if (bits == 32) {
            return 1;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        } else if (bits == 32) {
            return 3;
        }
    }
    return -1;
}

static void pdm_pcm_copy_rx_buffer_to_ringbuf(machine_pdm_pcm_obj_t *self) {
    uint8_t *rx_buf_sample_ptr = (uint8_t *)self->rx_buffer.processing_half_rx_fifo_buf_ptr;
    uint32_t num_bytes_needed_from_ringbuf = SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * SIZEOF_PDM_PCM_SAMPLE_IN_BYTES;

    // when space exists, copy samples into ring buffer
    if (ringbuf_free(&self->ring_buffer) >= num_bytes_needed_from_ringbuf) {
        uint8_t f_index = get_frame_mapping_index(self->bits, self->format);
        uint32_t i = 0;
        while (i < num_bytes_needed_from_ringbuf) {
            for (uint8_t j = 0; j < SIZEOF_PDM_PCM_SAMPLE_IN_BYTES; j++) {
                int8_t r_to_a_mapping = pdm_pcm_frame_map[f_index][j];
                if (r_to_a_mapping != -1) {
                    ringbuf_put(&self->ring_buffer, rx_buf_sample_ptr[i]);
                } else { // r_a_mapping == -1
                    ringbuf_put(&self->ring_buffer, -1);
                }
                i++;
            }
        }
    }
}

static void pdm_pcm_channel_irq_handler(uint8_t pdm_pcm_channel) {
    machine_pdm_pcm_obj_t *pdm_pcm_obj = (machine_pdm_pcm_obj_t *)pdm_pcm_channel_obj[pdm_pcm_channel].parent;
    volatile uint32_t intr_status = Cy_PDM_PCM_Channel_GetInterruptStatusMasked(pdm_pcm_obj->irq_channel->block->periph, pdm_pcm_obj->irq_channel->id);
    if (CY_PDM_PCM_INTR_RX_TRIGGER & intr_status) {
        pdm_pcm_read_into_rx_buffer(pdm_pcm_obj);
        Cy_PDM_PCM_Channel_ClearInterrupt(pdm_pcm_obj->irq_channel->block->periph, pdm_pcm_obj->irq_channel->id, CY_PDM_PCM_INTR_RX_TRIGGER);
        if (pdm_pcm_rx_buffer_is_half_full(&pdm_pcm_obj->rx_buffer)) {
            pdm_pcm_copy_rx_buffer_to_ringbuf(pdm_pcm_obj);
            if ((pdm_pcm_obj->io_mode == NON_BLOCKING) && (pdm_pcm_obj->non_blocking_descriptor.copy_in_progress)) {
                fill_appbuf_from_ringbuf_non_blocking(pdm_pcm_obj);
            }
        }
        if ((CY_PDM_PCM_INTR_RX_FIR_OVERFLOW | CY_PDM_PCM_INTR_RX_OVERFLOW | CY_PDM_PCM_INTR_RX_IF_OVERFLOW |
             CY_PDM_PCM_INTR_RX_UNDERFLOW) & intr_status) {
            Cy_PDM_PCM_Channel_ClearInterrupt(pdm_pcm_obj->irq_channel->block->periph, pdm_pcm_obj->irq_channel->id, CY_PDM_PCM_INTR_MASK);
        }
    }
}

/* -------------------------------- Private Functions -------------------------------- */

static void pdm_pcm_init(machine_pdm_pcm_obj_t *self) {
    self->irq_channel = self->channels[0];
    pdm_pcm_channel_init(self->channels[0], self->sample_rate, self->bits, false);
    if (self->format == STEREO) {
        self->irq_channel = self->channels[1];
        pdm_pcm_channel_init(self->channels[1], self->sample_rate, self->bits, true);
    }
    pdm_pcm_channel_irq_init(self->irq_channel);
}

static inline void pdm_pcm_alloc_channels(machine_pdm_pcm_obj_t *self, format_t format, const mp_hal_pin_af_config_t *af_config) {
    /**
     * The allowed pairs are form or consecutive odd + even channel starting
     * from 0.
     * Therefore, to find the secondary channel  id, XORing the primary
     * channel id with 0x01 will give the id of the other channel in the pair.
     */
    self->channels[0] = pdm_pcm_channel_alloc(af_config->af->unit, self);
    if (format == STEREO) {
        self->channels[1] = pdm_pcm_channel_alloc(af_config->af->unit ^ 0x01, self);
    }
}

static void pdm_pcm_start(machine_pdm_pcm_obj_t *self) {
    Cy_PDM_PCM_Activate_Channel(self->channels[0]->block->periph, self->channels[0]->id);
    if (self->format == STEREO) {
        Cy_PDM_PCM_Activate_Channel(self->channels[1]->block->periph, self->channels[1]->id);
    }
};

static void pdm_pcm_stop(machine_pdm_pcm_obj_t *self) {
    Cy_PDM_PCM_DeActivate_Channel(self->channels[0]->block->periph, self->channels[0]->id);
    if (self->format == STEREO) {
        Cy_PDM_PCM_DeActivate_Channel(self->channels[1]->block->periph, self->channels[1]->id);
    }
}

#define PDM_PCM_DEFAULT_GAIN_DB     (23.0)
#define PDM_PCM_MIN_GAIN_DB         (-103.0)
#define PDM_PCM_MAX_GAIN_DB         (83.0)

static float pdm_pcm_get_valid_gain_db(float gain_db) {
    if (gain_db < PDM_PCM_MIN_GAIN_DB) {
        return PDM_PCM_MIN_GAIN_DB;
    } else if (gain_db > PDM_PCM_MAX_GAIN_DB) {
        return PDM_PCM_MAX_GAIN_DB;
    } else {
        return gain_db;
    }
}

static cy_en_pdm_pcm_gain_sel_t pdm_pcm_gain_db_to_scale(float gain_db) {
    /**
    * The gain scale goes from PDM_PCM_MIN_GAIN_DB to PDM_PCM_MAX_GAIN_DB in
    * steps of 6 dB. The db gains map to an enum in the range from 0 to
    * (PDM_PCM_MAX_GAIN_DB - PDM_PCM_MIN_GAIN_DB) / 6 dB.
    */
    return (cy_en_pdm_pcm_gain_sel_t)roundf((PDM_PCM_MAX_GAIN_DB - gain_db) / 6.0);
}

static void pdm_pcm_set_gain(machine_pdm_pcm_obj_t *self) {
    cy_en_pdm_pcm_gain_sel_t gain_scale = pdm_pcm_gain_db_to_scale(self->gain_db);
    Cy_PDM_PCM_SetGain(self->channels[0]->block->periph, self->channels[0]->id, gain_scale);
    if (self->format == STEREO) {
        Cy_PDM_PCM_SetGain(self->channels[1]->block->periph, self->channels[1]->id, gain_scale);
    }
}

/* -------------------------------- Extmod API -------------------------------- */


static void mp_machine_pdm_pcm_init_helper(machine_pdm_pcm_obj_t *self, mp_arg_val_t *args) {
    /**
     * Get the pin objects passed by the constructor.
     * Validate that they are valid PDM block and channel,
     * and configure them with the adequate drive mode and
     * alternate function.
     * {
     */
    self->sck = mp_hal_get_pin_obj(args[ARG_sck].u_obj);
    self->data = mp_hal_get_pin_obj(args[ARG_data].u_obj);

    const mp_hal_pin_af_config_t pdm_pins_config[] = {
        MP_HAL_PIN_AF_CONF_INIT(self->sck, CY_GPIO_DM_STRONG_IN_OFF, 1, MACHINE_PIN_AF_SIGNAL_PDM_CLK),
        MP_HAL_PIN_AF_CONF_INIT(self->data, CY_GPIO_DM_HIGHZ, 1, MACHINE_PIN_AF_SIGNAL_PDM_DATA),
    };

    machine_pin_af_unit_t af_unit = MACHINE_PIN_AF_UNIT_NONE;
    mp_hal_periph_pins_af_resolve_fn_unit(pdm_pins_config, 2, MACHINE_PIN_AF_FN_PDM, &af_unit);

    mp_hal_periph_pins_af_init(pdm_pins_config, 2);
    /** } */

    /**
     * Depending on the format, one or two channels
     * are then allocated from the available channels.
     * {
     */
    format_t pdm_pcm_format = args[ARG_format].u_int;
    if ((pdm_pcm_format != MONO) &&
        (pdm_pcm_format != STEREO)) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid format"));
    }
    self->format = pdm_pcm_format;

